In [149]:
# Dependencies
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import requests
from census import Census
import gmaps

# Census & gmaps API Keys
from popconfig import (census_api, gkey)
c = Census(census_api, year=2018)

# Configure gmaps
gmaps.configure(api_key=gkey)

In [150]:
# # Run Census Search to retrieve data on all states
# # Note the addition of "B23025_005E" for unemployment count
# census_data = c.acs5.get(("NAME", "B19013_001E", "B01003_001E", "B01002_001E",
#                           "B17001_002E",
#                           "B23025_005E"), {'for': 'state:*'})

# # Convert to DataFrame
# census_pd = pd.DataFrame(census_data)

# # Column Reordering
# census_pd = census_pd.rename(columns={"B01003_001E": "Population",
#                                       "B01002_001E": "Median Age",
#                                       "B19013_001E": "Household Income",
#                                       "B17001_002E": "Poverty Count",
#                                       "B23025_005E": "Unemployment Count",
#                                       "NAME": "Name", "state": "State"})

# # Add in Poverty Rate (Poverty Count / Population)
# census_pd["Poverty Rate"] = 100 * \
#     census_pd["Poverty Count"].astype(
#         int) / census_pd["Population"].astype(int)

# # Add in Employment Rate (Employment Count / Population)
# census_pd["Unemployment Rate"] = 100 * \
#     census_pd["Unemployment Count"].astype(
#         int) / census_pd["Population"].astype(int)

# # Final DataFrame
# census_pd = census_pd[["State", "Name", "Population", "Median Age", "Household Income",
#                        "Poverty Count", "Poverty Rate", "Unemployment Rate"]]

# census_pd.head()

,State,Name,Population,Median Age,Household Income,Poverty Count,Poverty Rate,Unemployment Rate
0,27,Minnesota,5527358.0,37.9,68411.0,547442.0,9.904225,2.156871
1,28,Mississippi,2988762.0,37.2,43567.0,599795.0,20.068343,3.681658
2,29,Missouri,6090062.0,38.5,53560.0,837930.0,13.758973,2.560861
3,30,Montana,1041732.0,39.8,52559.0,139063.0,13.349211,2.153433
4,31,Nebraska,1904760.0,36.4,59116.0,213790.0,11.223986,1.918614

In [170]:
# Run Census Search to retrieve data on all cities

louisiana_df = c.acs5.state_place(("NAME", "B01003_001E"),"22","55000")
louisiana_df = pd.DataFrame(louisiana_df)
louisiana_df

                          NAME  B01003_001E state  place
0  New Orleans city, Louisiana     389648.0    22  55000

In [169]:
missouri_df = c.acs5.state_place(("NAME", "B01003_001E"),"29","38000")
missouri_df = pd.DataFrame(missouri_df)
missouri_df

                         NAME  B01003_001E state  place
0  Kansas City city, Missouri     481417.0    29  38000

In [172]:
texas_df = c.acs5.state_place(("NAME", "B01003_001E"),"48","19000")
texas_df = pd.DataFrame(texas_df)
texas_df

                 NAME  B01003_001E state  place
0  Dallas city, Texas    1318806.0    48  19000

In [173]:
oregon_df = c.acs5.state_place(("NAME", "B01003_001E"),"41","59000")
oregon_df = pd.DataFrame(oregon_df)
oregon_df

                    NAME  B01003_001E state  place
0  Portland city, Oregon     639387.0    41  59000

In [174]:
virginia_df = c.acs5.state_place(("NAME", "B01003_001E"),"51","14968")
virginia_df = pd.DataFrame(virginia_df)
virginia_df

                             NAME  B01003_001E state  place
0  Charlottesville city, Virginia      47042.0    51  14968

In [175]:
illinois_df = c.acs5.state_place(("NAME", "B01003_001E"),"17","14000")
illinois_df = pd.DataFrame(illinois_df)
illinois_df

                     NAME  B01003_001E state  place
0  Chicago city, Illinois    2718555.0    17  14000

In [176]:
colorado_df = c.acs5.state_place(("NAME", "B01003_001E"),"08","20000")
colorado_df = pd.DataFrame(colorado_df)
colorado_df

                    NAME  B01003_001E state  place
0  Denver city, Colorado     693417.0    08  20000

In [177]:
sdakota_df = c.acs5.state_place(("NAME", "B01003_001E"),"46","59020")
sdakota_df = pd.DataFrame(sdakota_df)
sdakota_df

                             NAME  B01003_001E state  place
0  Sioux Falls city, South Dakota     174151.0    46  59020

In [178]:
nevada_df = c.acs5.state_place(("NAME", "B01003_001E"),"32","40000")
nevada_df = pd.DataFrame(nevada_df)
nevada_df

                     NAME  B01003_001E state  place
0  Las Vegas city, Nevada     626637.0    32  40000

In [179]:
california_df = c.acs5.state_place(("NAME", "B01003_001E"),"06","67000")
california_df = pd.DataFrame(california_df)
california_df

                             NAME  B01003_001E state  place
0  San Francisco city, California     870044.0    06  67000

In [180]:
tennessee_df = c.acs5.state_place(("NAME", "B01003_001E"),"47","14000")
tennessee_df = pd.DataFrame(tennessee_df)
tennessee_df

                          NAME  B01003_001E state  place
0  Chattanooga city, Tennessee     177365.0    47  14000

In [181]:
massachusetts_df = c.acs5.state_place(("NAME", "B01003_001E"),"25","07000")
massachusetts_df = pd.DataFrame(massachusetts_df)
massachusetts_df

                         NAME  B01003_001E state  place
0  Boston city, Massachusetts     679413.0    25  07000

In [192]:
city_data = louisiana_df.append([missouri_df,oregon_df,massachusetts_df, tennessee_df, virginia_df, california_df, colorado_df, sdakota_df, nevada_df, illinois_df, texas_df])
city_data = city_data.rename(columns={"B01003_001E": "Population",
                                      "NAME": "City, State",
                                      "state": "State Number",
                                     })
city_data

                      City, State  Population State Number  place
0     New Orleans city, Louisiana    389648.0           22  55000
0      Kansas City city, Missouri    481417.0           29  38000
0           Portland city, Oregon    639387.0           41  59000
0      Boston city, Massachusetts    679413.0           25  07000
0     Chattanooga city, Tennessee    177365.0           47  14000
0  Charlottesville city, Virginia     47042.0           51  14968
0  San Francisco city, California    870044.0           06  67000
0           Denver city, Colorado    693417.0           08  20000
0  Sioux Falls city, South Dakota    174151.0           46  59020
0          Las Vegas city, Nevada    626637.0           32  40000
0          Chicago city, Illinois   2718555.0           17  14000
0              Dallas city, Texas   1318806.0           48  19000

In [194]:
# Save as a csv
# Note to avoid any issues later, use encoding="utf-8"
city_data.to_csv("census_data.csv", encoding="utf-8", index=False)

In [12]:
#list_a = ["Missouri", "Virginia", "Louisiana", "South Dakota", "Nevada",
#         "Oregon", "Texas", "Illinois", "Tennessee", "Massachusetts",
#         "California", "Colorado"]
#print(list_a)

['Missouri', 'Virginia', 'Louisiana', 'South Dakota', 'Nevada', 'Oregon', 'Texas', 'Illinois', 'Tennessee', 'Massachusetts', 'California', 'Colorado']

In [29]:
#states = census_pd.loc[census_pd["Name"].isin(["Missouri","Virginia","Louisiana",
#                            "South Dakota","Nevada","Oregon","Texas","Illinois",
#                            "Tennessee","Massachusetts","California","Colorado"])]
        





#states

,State,Name,Population,Median Age,Household Income,Poverty Count,Poverty Rate,Unemployment Rate
4,06,California,39283497.0,36.5,75235.0,5149742.0,13.109174,3.052765
5,08,Colorado,5610349.0,36.7,72331.0,565873.0,10.086235,2.341583
13,17,Illinois,12770631.0,38.1,65886.0,1557873.0,12.198873,3.092886
18,22,Louisiana,4664362.0,36.9,49469.0,871467.0,18.683520,3.023350
21,25,Massachusetts,6850553.0,39.5,81215.0,680962.0,9.940249,2.676499
25,29,Missouri,6104910.0,38.6,55461.0,810045.0,13.268746,2.289780
28,32,Nevada,2972382.0,38.0,60365.0,384690.0,12.942145,3.109493
37,41,Oregon,4129803.0,39.3,62818.0,533527.0,12.918946,2.773958
41,46,South Dakota,870638.0,37.0,58275.0,110553.0,12.697930,1.807410
42,47,Tennessee,6709356.0,38.7,53320.0,996930.0,14.858803,2.575493
43,48,Texas,28260856.0,34.6,61874.0,4072194.0,14.409309,2.508158
46,51,Virginia,8454463.0,38.2,74222.0,865691.0,10.239456,2.375668

In [31]:
#states_population = states[["Name","Population"]]
#states_population

             Name  Population
4      California  39283497.0
5        Colorado   5610349.0
13       Illinois  12770631.0
18      Louisiana   4664362.0
21  Massachusetts   6850553.0
25       Missouri   6104910.0
28         Nevada   2972382.0
37         Oregon   4129803.0
41   South Dakota    870638.0
42      Tennessee   6709356.0
43          Texas  28260856.0
46       Virginia   8454463.0